![DF](cover/03.%20DataFrame.png)

#### Outline
* Creating a DataFrame
* Update a DataFrame
* Create a DataFrame with Different Way

### What is a DataFrame?
A DataFrame in Pandas is like a table â€” just like what you see in Excel or Google Sheets.
* Rows are like records
* Columns are like attributes

#### Import Library

In [2]:
import pandas as pd

#### Create a DataFrame

In [10]:
a = [1, 2, 3]

df = pd.DataFrame(a)

df

   0
0  1
1  2
2  3

In [11]:
df1 = pd.DataFrame([1, 2, 3, 4])
df1

   0
0  1
1  2
2  3
3  4

In [13]:
# create a two col DataFrame
df3 = pd.DataFrame([[1, 2], [3, 4]])
df3

   0  1
0  1  2
1  3  4

In [14]:
df4 = pd.DataFrame([['a', 2], ['b', 4]])
df4

   0  1
0  a  2
1  b  4

In [15]:
# create a three col DataFrame
df5 = pd.DataFrame([['a', 2, 3.5], ['b', 4, 5.6]])
df5

   0  1    2
0  a  2  3.5
1  b  4  5.6

### Change the Column Name

In [16]:
df1 = pd.DataFrame([1, 2, 3, 4], columns=['Numbers'])
df1

   Numbers
0        1
1        2
2        3
3        4

In [17]:
df3 = pd.DataFrame([[1, 2], [3, 4]], columns=['Col1', 'Col2'])
df3

   Col1  Col2
0     1     2
1     3     4

In [18]:
df5 = pd.DataFrame([['a', 2, 3.5], ['b', 4, 5.6]], columns=['Letter', 'Integer', 'Float'])
df5

  Letter  Integer  Float
0      a        2    3.5
1      b        4    5.6

In [19]:
a = [1, 2, 3]
df_ = pd.DataFrame(a)
df_.columns = ['Numbers']
df_

   Numbers
0        1
1        2
2        3

#### Change the Index name

In [20]:
b = [1, 2, 3]
df = pd.DataFrame(b, columns = ["Number"], index = ["I", "II", "III"])
df

     Number
I         1
II        2
III       3

In [24]:
df5 = pd.DataFrame([['a', 2, 3.5], ['b', 4, 5.6]], columns=['Letter', 'Integer', 'Float'])
df5

  Letter  Integer  Float
0      a        2    3.5
1      b        4    5.6

In [26]:
df5.index = ['I', 'II']
df5.index.name = 'Row_ID'
df5

       Letter  Integer  Float
Row_ID
I           a        2    3.5
II          b        4    5.6

#### Create a DataFrame with Different Way

In [27]:
# Create a DataFrame with Dictionary
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'],
                   'Age': [25, 30, 35],
                   'City': ['New York', 'Los Angeles', 'Chicago']})
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [28]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [29]:
# Create a DataFrame with list of dictionaries
df = pd.DataFrame([{'A': 1, 'B': 2}, {'A': 3, 'B': 4}])
df

   A  B
0  1  2
1  3  4

In [31]:
df1 = pd.DataFrame([{'A':1, 'B': 5, 'C': 9}, {'A':1, 'B': 5, 'C': 9}, {'A':1, 'B': 5, 'C': 9}])
df1

   A  B  C
0  1  5  9
1  1  5  9
2  1  5  9

In [32]:
# Create a DataFrame with Dictionary of Series
df = pd.DataFrame({'A': pd.Series([1, 2, 3]),
                   'B': pd.Series([4, 5, 6])})
df

   A  B
0  1  4
1  2  5
2  3  6

In [34]:
df = pd.DataFrame({'A': pd.Series([1, 2, 3])})
df

   A
0  1
1  2
2  3

### For Source code:
https://sites.google.com/view/aorbtech/programming/

### @Aorb Tech